const services = [

  // Almera (G15) ТО
  {
    title: 'Замена уплотнительного кольца', price: '79',
  }, {
    title: 'Замена масляного фильтра', price: '450',
  }, {
    title: 'Замена воздушного фильтра', price: '1040',
  }, {
    title: 'Замена моторного масла', price: '2530',
  }, {
    title: 'Набор автохимии для технического обслуживания', price: '1260',
  }, {
    title: 'Замена болтов катушки зажигания', price: '660',
  }, {
    title: 'Замена свечей зажигания', price: '1325',
  }, {
    title: 'Замена тормозной жидкости', price: '930',
  }, {
    title: 'Замена болта натежителя ремня ГРМ', price: '90',
  }, {
    title: 'Замена ремня привода ГРМ', price: '660',
  }, {
    title: 'Замена заглушки впускного распредвала', price: '330',
  }, {
    title: 'Замена заглушки выпускного распредвала', price: '250',
  }, {
    title: 'Замена ремня привода генератора', price: '2700',
  }, {
    title: 'Замена обводного ролика приводного ремня', price: '1930',
  }, {
    title: 'Замена натяжителя приводного ремня', price: '3800',
  }, {
    title: 'Замена шкива коленчатого вала', price: '5500',
  }, {
    title: 'Замена болта ролика натяжителя', price: '205',
  }, {
    title: 'Замена охлаждающей жидкости type d (концентрат)', price: '2500',
  }, {
    title: 'Работа мастера', price: '2750',
  }, {
    title: 'Работа мастера', price: '4000',
  }, {
    title: 'Работа мастера', price: '7500',
  },

  // Tiida (C13) ТО
  {
    title: 'Замена уплотнительного кольца', price: '75',
  }, {
    title: 'Замена масляного фильтра', price: '890',
  }, {
    title: 'Замена моторного масла', price: '2250',
  }, {
    title: 'Замена воздушного фильтра', price: '1530',
  }, {
    title: 'Замена фильтра салона', price: '1710',
  }, {
    title: 'Замена свечей зажигания', price: '7970',
  }, {
    title: 'Замена тормозной жидкости', price: '930',
  }, {
    title: 'Замена охлаждающей жидкости', price: '2130',
  }, {
    title: 'Набор автохимии для технического обслуживания', price: '1250',
  }, {
    title: 'Работа мастера', price: '2500',
  }, {
    title: 'Работа мастера', price: '4000',
  }, {
    title: 'Работа мастера', price: '4500',
  },

  // Juke (F15) ТО
  {
    title: 'Замена уплотнительного кольца', price: '75',
  }, {
    title: 'Замена масляного фильтра', price: '450',
  }, {
    title: 'Замена моторного масла', price: '2250',
  }, {
    title: 'Замена воздушного фильтра', price: '1400',
  }, {
    title: 'Замена фильтра салона', price: '730',
  }, {
    title: 'Замена свечей зажигания', price: '7800',
  }, {
    title: 'Замена тормозной жидкости', price: '900',
  }, {
    title: 'Замена прокладки', price: '2200',
  }, {
    title: 'Замена прокладки дроссельной заслонки', price: '450',
  }, {
    title: 'Замена охлаждающей жидкости', price: '2000',
  }, {
    title: 'Набор автохимии для технического обслуживания', price: '1250',
  }, {
    title: 'Работа мастера', price: '3000',
  }, {
    title: 'Работа мастера', price: '4500',
  }, {
    title: 'Работа мастера', price: '5000',
  },

  // Qashqai (J11) ТО
  {
    title: 'Замена уплотнительного кольца', price: '75',
  }, {
    title: 'Уплотнение корпуса редуктора', price: '350',
  }, {
    title: 'Замена масляного фильтра', price: '450',
  }, {
    title: 'Замена моторного масла', price: '2000',
  }, {
    title: 'Замена фильтра салона', price: '2000',
  }, {
    title: 'Уплотнение пробки корпуса раздаточной коробки', price: '450',
  }, {
    title: 'Замена свечей зажигания', price: '7900',
  }, {
    title: 'Замена воздушного фильтра', price: '1950',
  }, {
    title: 'Замена тормозной жидкости', price: '950',
  }, {
    title: 'Замена охлаждающей жидкости', price: '2350',
  }, {
    title: 'Набор автохимии для технического обслуживания', price: '1250',
  }, {
    title: 'Работа мастера', price: '4000',
  }, {
    title: 'Работа мастера', price: '6000',
  }, {
    title: 'Работа мастера', price: '6500',
  },

  // Pathfinder (R52) ТО
  {
    title: 'Замена уплотнительного кольца', price: '75',
  }, {
    title: 'Замена масляного фильтра', price: '890',
  }, {
    title: 'Замена воздушного фильтра', price: '1250',
  }, {
    title: 'Замена свеч с платиновым наконечником', price: '11500',
  }, {
    title: 'Замена моторного масла', price: '2500',
  }, {
    title: 'Замена фильтра салона', price: '1200',
  }, {
    title: 'Замена тормозной жидкости', price: '900',
  }, {
    title: 'Замена охлаждающей жидкости', price: '300',
  }, {
    title: 'Уплотнение пробки корпуса раздаточной коробки', price: '450',
  }, {
    title: 'Набор автохимии для технического обслуживания', price: '1250',
  }, {
    title: 'Работа мастера', price: '3000',
  }, {
    title: 'Работа мастера', price: '7500',
  }, {
    title: 'Работа мастера', price: '8000',
  },
];

module.exports = {
  up: async (queryInterface, Sequelize) => {
    for (let i = 0; i < services.length; i += 1) {
      // eslint-disable-next-line no-await-in-loop
      await queryInterface.bulkInsert('Services', [{
        title: services[i].title,
        price: services[i].price,

        createdAt: new Date(),
        updatedAt: new Date(),
      }], {});
    }
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete('Services', null, {});
  },
};
