import React from 'react';
import styles from "../Order/Order.module.css";

function Order() {
	return (
		<ul className={styles.order}>
			<li>Tiida</li>
			<li>ГГ.ММ.ДД 00:00</li>
			<li>46789 км</li>
			<li>Филатов А. С.</li>
			<li>TO-4</li>
			<li>Услуги</li>
			<li>Замена фильтра 600</li>
			<li>Замена фильтра 400</li>
			<li>Замена фильтра 700</li>
			<li>Замена фильтра 8000</li>
			<li>Замена фильтра 900</li>
			<li>Замена фильтра 400</li>
			<li>Замена фильтра 300</li>
			<li>Замена фильтра 200</li>
			<li>Запчасти</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 7000</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Масляный фильтр 700</li>
			<li>Общая стоимость</li>
		</ul>
	);
}

export default Order;
